#+setupfile: ../setup.org
#+export_file_name: index

#+hugo_bundle: object
#+title: object
#+date: <2020-12-23 三 11:59>

lua 是一种动态类型语言，类型不存在于变量中，而存在于值本身。

语言中定义了 8 种类型的值
- nil
- bool
- number
- string
- table
- function
- userdata
- thread

虽然章节名称为 object，和源代码的名称相同。
但是通常都翻译为“对象”，容易与 OOP 中的对象概念混杂在一起。
在本章，更乐意将其译为“值”。

从某种角度而言，程序就是“数据”与“操作数据的方法”。
所以第一步，先来了解 lua 中的值。

* TODO review struct & union

https://stackoverflow.com/questions/119123/why-isnt-sizeof-for-a-struct-equal-to-the-sum-of-sizeof-of-each-member

http://www.catb.org/esr/structure-packing/



https://gcc.gnu.org/onlinedocs/gcc-3.3/gcc/Type-Attributes.html

https://gcc.gnu.org/onlinedocs/gcc/Alignment.html

https://stackoverflow.com/questions/14332633/attribute-packed-v-s-gcc-attribute-alignedx

https://softwareengineering.stackexchange.com/questions/256179/the-advantage-of-using-attribute-aligned



- struct memory
  - stack and count
  - mem padding in the last
  - in array, just padding * count
- union memory
  - share
  - rely on the largest
  - array, just size * count
- struct in union, gcobject hack

- how dummy works
- union in array?

#+begin_src C :flags -m32
typedef struct s1 {
  short a;
  int b;
  char c;
} s1;

typedef union u1 {
  int a;
  char b;
} u1;
  
printf("sizeof(s1) = %d\n", sizeof(s1));
printf("sizeof(u1) = %d\n", sizeof(u1));
printf("sizeof(void*) = %d\n", sizeof(void*));
#+end_src

#+RESULTS:
| sizeof(s1)    | = | 12 |
| sizeof(u1)    | = |  4 |
| sizeof(void*) | = |  4 |

